---
kind: method
id: M:Autodesk.Revit.DB.Lighting.CustomInitialColor.#ctor(Autodesk.Revit.DB.Lighting.CustomInitialColor)
source: html/39c75b78-9dfe-2795-6d67-27fce097d2cf.htm
---
# Autodesk.Revit.DB.Lighting.CustomInitialColor.#ctor Method

Creates a copy of the given custom initial color

## Syntax (C#)
```csharp
public CustomInitialColor(
	CustomInitialColor other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.CustomInitialColor`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null